// Напишете функция, която извежда на конзолата номерата на стаите в една сграда (в низходящ ред), като са изпълнени следните условия:
// •	На всеки четен етаж има само офиси
// •	На всеки нечетен етаж има само апартаменти
// •	Всеки апартамент се означава по следния начин : А{номер на етажа}{номер на апартамента}, номерата на апартаментите започват от 0.
// •	Всеки офис се означава по следния начин : О{номер на етажа}{номер на офиса}, номерата на офисите също започват от 0.
// •	На последният етаж винаги има апартаменти и те са по-големи от останалите, за това пред номера им пише 'L', вместо 'А'. Ако има само един етаж, то има само големи апартаменти!
// Функцията получава масив от две цели числа - броят на етажите и броят на стаите за един етаж. 

function building(input) {
    let floorsNumber = (input[0])
    let roomsNumber = (input[1])
    for (let x = floorsNumber; x >= 1; x--) {
        let buff = ''

        for (let y = 0; y < roomsNumber; y++) {
            if (x === floorsNumber) {
                buff += `L${x}${y} `
            } else if (x % 2 === 0) {
                buff += `O${x}${y} `
            } else {
                buff += `A${x}${y} `
            }

        } console.log(buff);
    }

}

building(["4", "4"])