// Група ентусиасти обикалят по различни локации, където има златни мини. 
// Вашата задача е да им помогнете като напишете програма, която да приема броя на локациите и очакван среден добив на злато за ден за една локация.
//  За всеки ден ще получавате колко злато са добили на локацията. Проверете дали са постигнали очаквания добив за дадена локация или не.
// Вход:
// Първоначално от конзолата се прочита едно число – брой локации – цяло число в интервала [1.. 100]
// За всяка една локация се четат две числа, по едно на ред:
// 1.	На първия ред – очакван среден добив на ден злато – реално число в интервала [0.00.. 10000.00]
// 2.	На втория ред – брой дни, в който ще се копае на дадената локация – цяло число в интервала [1.. 30]
// За всеки ден се чете по едно число:
// •	Добито злато за деня – реално число в интервала [0.00.. 1000.00]
// Изход:
// След приключване на копаенето на дадена локация се печата един ред според случая:
// •	Ако средният добив злато за ден достига или надвишава очаквания среден добив на ден злато:
// o	"Good job! Average gold per day: {среден добив на ден за дадената локация}."
// •	Ако средният добив злато за ден е под очаквания среден добив на ден злато:
// o	"You need {злато, което не е достигнало за достигане на очакваният среден добив} gold."
// Резултатът да бъде форматиран до вторият знак след десетичният разделител.

function goldmine(input) {
    let index = 0
    let location = Number(input[index])
    index++
    let rezilt = 0
    // let AverageDobiv = Number(input[1])
    // let numberOfDaysSpend = Number(input[2])
    // let firtstDay = Number(input[3])

    for (let i = 1; i <= location; i++) {
        let AverageDobiv = Number(input[index])
        index++
        let numberOfDaysSpend = Number(input[index])
        index++
        let buff = 0

        for (let y = 1; y <= numberOfDaysSpend; y++) {
            let firtstDay = Number(input[index])
            index++
            buff += firtstDay
            rezilt = buff / numberOfDaysSpend

        }
        if (rezilt >= AverageDobiv) {
            console.log(`Good job! Average gold per day: ${rezilt.toFixed(2)}.`);
        } else {
            let neededGold = AverageDobiv - rezilt
            console.log(`You need ${neededGold.toFixed(2)} gold.`);
        }



    }
}






goldmine(["2",
    "10",
    "3",
    "10",
    "10",
    "11",
    "20",
    "2",
    "20",
    "10"])
