// Напишете функция, която получава текст (стринг) и печата всеки символ от текста на отделен ред.
// Примерен вход и изход
// вход	изход	вход	изход

// 1.	Направете for цикъл с начална стойност на контролната променлива от 0 до input.length (дължината на текста). 
// На всяка итерация взимайте буквата на позиция във въведената дума равна на стойността на контролната променлива i, чрез []

function characterSequence(input) {
    let name = input[0];

    for (let i = 0; i < name.length; i++) {
        console.log(name[i]);
    }

}
characterSequence(["softuni"])