// След успешно класиране, група заминава за  финалното състезание. След представянето си всяка група получава парична награда. 
// Тя зависи от: държавата, в която се е провело състезанието; броя точки, които журито е дало и сезонът, през който се е провело състезанието.    
// •	Ако състезанието се е провело в България паричната награда се изчислява като се умножат точките по броя участниците.
// •	Ако се е провело в чужбина – се умножават броя участници по броя точки и към тях се добавя 50% от получената сума. 
// От получената сума се изваждат разходите посочени в проценти спрямо сезона, през който се е провел:
// 	        Лято	Зима
// България	5%	     8%
// Чужбина	10%	    15%

// След завръщането си групата дарява 75% от сумата, след приспаднатите разходи, за благотворителност. Останалата сума се разпределя между членовете на групата.
// Да се  напише програма, която изчислява колко пари са дадени за благотворителност и колко е получил всеки един член на групата. 
// Вход:
// От конзолата се четат 4 реда:
// 1.	Брой танцьори – цяло число в интервала [1 … 10]
// 2.	Брой точки – реално число в интервала [1.00 … 10000.00]
// 3.	Сезон –  текст със следните възможности - "summer" или "winter"
// 4.	Място – текст със следните възможности - "Bulgaria" или "Abroad"
// Изход:
// На конзолата се отпечатват 2 реда:
// •	Сумата, която са дали за благотворителност
// "Charity - {сума за благотворителност}"
// •	Сумата, която е получил всеки танцьор
// "Money per dancer - {сума за танцьор}"
// Сумите да бъдат форматирани до втория знак след десетичната запетая.

function finalCompetition(input) {
    let numberOfPeople = Number(input[0])
    let numberOfPoints = Number(input[1])
    let season = input[2]
    let destination = input[3]

    let sum = 0
    switch (destination) {
        case "Bulgaria": sum = (numberOfPeople * numberOfPoints)
            if (season === "summer") {
                sum *= 0.95
            } else if (season === "winter") {
                sum *= 0.92
            }
            break;
        case "Abroad": sum = (numberOfPeople * numberOfPoints)
            sum = sum + (sum * 0.50)
            if (season === "summer") {
                sum *= 0.90
            } else if (season === "winter") {
                sum *= 0.85
            } break

    }
    let charity = (sum * 0.75).toFixed(2)
    let peopleMoney = (sum - charity) / numberOfPeople

    console.log(`Charity - ${charity}`);
    console.log(`Money per dancer - ${peopleMoney.toFixed(2)}`);
}

finalCompetition
    (["1",
        "89.5",
        "summer",
        "Abroad"])



